loadTest.yml
config:
  target: 'http://localhost:7777'
  phases:
    # - pause: 30
    - duration: 60
      arrivalRate: 200

scenarios:
  - flow:
    # - loop:
    - get:
        url: "/checkout/{{$randomNumber(1, 10000000)}}"
    # count: 1


# # scenarios:
# #   - flow:
#     - loop:
#         - get:
#             url: "/checkout/{{$randomNumber(1, 10000000)}}"
        # - post:
        #     url: "/checkout"
#     count: 20